from django.http import HttpResponse
from django.shortcuts import render

def index(request):
    context = {
        'title': 'Home - Главная',
        'content': 'Магазин побутової хімії'

    }

    return render(request, 'main/index.html', context)

def about(request):
    context = {
        'title': 'Про нас',
        'content': 'Про нас',
        'text_on_page':
        """
            GlobeClean - інноваційна компанія, яка розвиває та впроваджує передові екологічні технології виробництва побутової хімії. Заснована багато років тому, компанія GlobeClean в 2022 році запустила власне виробництво миючих засобів. Місія компанії - забезпечувати клієнтів якісною, екологічною продукцією за вигідними цінами та розвивати власне виробництво в Україні.

ТМ GlobeClean базується на заводі компанії GlobeCore в Полтаві, відомому своєю професійністю протягом понад 50 років. GlobeClean виробляє українську продукцію за німецькими стандартами, дотримуючись сучасних тенденцій в галузі екології. Ключові принципи - якість, доступна ціна, стильний дизайн, затишок і краса в кожен дім. Компанія самостійно розробляє рецептури продукції, експериментує та тестує продукцію, дотримуючись високих стандартів якості.        
        """


    }

    return render(request, 'main/about.html', context)


